zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/twis.h
#define TWIS_TR_OFFSET              0x08         /**< \brief (TWIS_TR offset) Timing Register */
#define TWIS_TR_RESETVALUE          _U_(0x00000000); /**< \brief (TWIS_TR reset_value) Timing Register */

#define TWIS_TR_TLOWS_Pos           0            /**< \brief (TWIS_TR) SMBus Tlow:sext Cycles */
#define TWIS_TR_TLOWS_Msk           (_U_(0xFF) << TWIS_TR_TLOWS_Pos)
#define TWIS_TR_TLOWS(value)        (TWIS_TR_TLOWS_Msk & ((value) << TWIS_TR_TLOWS_Pos))
#define TWIS_TR_TTOUT_Pos           8            /**< \brief (TWIS_TR) SMBus Ttimeout Cycles */
#define TWIS_TR_TTOUT_Msk           (_U_(0xFF) << TWIS_TR_TTOUT_Pos)
#define TWIS_TR_TTOUT(value)        (TWIS_TR_TTOUT_Msk & ((value) << TWIS_TR_TTOUT_Pos))
#define TWIS_TR_SUDAT_Pos           16           /**< \brief (TWIS_TR) Data Setup Cycles */
#define TWIS_TR_SUDAT_Msk           (_U_(0xFF) << TWIS_TR_SUDAT_Pos)
#define TWIS_TR_SUDAT(value)        (TWIS_TR_SUDAT_Msk & ((value) << TWIS_TR_SUDAT_Pos))
#define TWIS_TR_EXP_Pos             28           /**< \brief (TWIS_TR) Clock Prescaler */
#define TWIS_TR_EXP_Msk             (_U_(0xF) << TWIS_TR_EXP_Pos)
#define TWIS_TR_EXP(value)          (TWIS_TR_EXP_Msk & ((value) << TWIS_TR_EXP_Pos))
#define TWIS_TR_MASK                _U_(0xF0FFFFFF) /**< \brief (TWIS_TR) MASK Register */

/* -------- TWIS_RHR : (TWIS Offset: 0x0C) (R/  32) Receive Holding Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXDATA:8;         /*!< bit:  0.. 7  Received Data Byte                 */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_RHR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_RHR_OFFSET             0x0C         /**< \brief (TWIS_RHR offset) Receive Holding Register */
#define TWIS_RHR_RESETVALUE         _U_(0x00000000); /**< \brief (TWIS_RHR reset_value) Receive Holding Register */

#define TWIS_RHR_RXDATA_Pos         0            /**< \brief (TWIS_RHR) Received Data Byte */
#define TWIS_RHR_RXDATA_Msk         (_U_(0xFF) << TWIS_RHR_RXDATA_Pos)
#define TWIS_RHR_RXDATA(value)      (TWIS_RHR_RXDATA_Msk & ((value) << TWIS_RHR_RXDATA_Pos))
#define TWIS_RHR_MASK               _U_(0x000000FF) /**< \brief (TWIS_RHR) MASK Register */

/* -------- TWIS_THR : (TWIS Offset: 0x10) ( /W 32) Transmit Holding Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXDATA:8;         /*!< bit:  0.. 7  Data Byte to Transmit              */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_THR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_THR_OFFSET             0x10         /**< \brief (TWIS_THR offset) Transmit Holding Register */
#define TWIS_THR_RESETVALUE         _U_(0x00000000); /**< \brief (TWIS_THR reset_value) Transmit Holding Register */

#define TWIS_THR_TXDATA_Pos         0            /**< \brief (TWIS_THR) Data Byte to Transmit */
#define TWIS_THR_TXDATA_Msk         (_U_(0xFF) << TWIS_THR_TXDATA_Pos)
#define TWIS_THR_TXDATA(value)      (TWIS_THR_TXDATA_Msk & ((value) << TWIS_THR_TXDATA_Pos))
#define TWIS_THR_MASK               _U_(0x000000FF) /**< \brief (TWIS_THR) MASK Register */

/* -------- TWIS_PECR : (TWIS Offset: 0x14) (R/  32) Packet Error Check Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PEC:8;            /*!< bit:  0.. 7  Calculated PEC Value               */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_PECR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_PECR_OFFSET            0x14         /**< \brief (TWIS_PECR offset) Packet Error Check Register */
#define TWIS_PECR_RESETVALUE        _U_(0x00000000); /**< \brief (TWIS_PECR reset_value) Packet Error Check Register */

#define TWIS_PECR_PEC_Pos           0            /**< \brief (TWIS_PECR) Calculated PEC Value */
#define TWIS_PECR_PEC_Msk           (_U_(0xFF) << TWIS_PECR_PEC_Pos)
#define TWIS_PECR_PEC(value)        (TWIS_PECR_PEC_Msk & ((value) << TWIS_PECR_PEC_Pos))
#define TWIS_PECR_MASK              _U_(0x000000FF) /**< \brief (TWIS_PECR) MASK Register */

/* -------- TWIS_SR : (TWIS Offset: 0x18) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXRDY:1;          /*!< bit:      0  RX Buffer Ready                    */
    uint32_t TXRDY:1;          /*!< bit:      1  TX Buffer Ready                    */
    uint32_t SEN:1;            /*!< bit:      2  Slave Enabled                      */
    uint32_t TCOMP:1;          /*!< bit:      3  Transmission Complete              */
    uint32_t :1;               /*!< bit:      4  Reserved                           */
    uint32_t TRA:1;            /*!< bit:      5  Transmitter Mode                   */
    uint32_t URUN:1;           /*!< bit:      6  Underrun                           */
    uint32_t ORUN:1;           /*!< bit:      7  Overrun                            */
    uint32_t NAK:1;            /*!< bit:      8  NAK Received                       */
    uint32_t :3;               /*!< bit:  9..11  Reserved                           */
    uint32_t SMBTOUT:1;        /*!< bit:     12  SMBus Timeout                      */
    uint32_t SMBPECERR:1;      /*!< bit:     13  SMBus PEC Error                    */
    uint32_t BUSERR:1;         /*!< bit:     14  Bus Error                          */
    uint32_t :1;               /*!< bit:     15  Reserved                           */
    uint32_t SAM:1;            /*!< bit:     16  Slave Address Match                */
    uint32_t GCM:1;            /*!< bit:     17  General Call Match                 */
    uint32_t SMBALERTM:1;      /*!< bit:     18  SMBus Alert Response Address Match */
    uint32_t SMBHHM:1;         /*!< bit:     19  SMBus Host Header Address Match    */
    uint32_t SMBDAM:1;         /*!< bit:     20  SMBus Default Address Match        */
    uint32_t STO:1;            /*!< bit:     21  Stop Received                      */
    uint32_t REP:1;            /*!< bit:     22  Repeated Start Received            */
    uint32_t BTF:1;            /*!< bit:     23  Byte Transfer Finished             */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_SR_OFFSET              0x18         /**< \brief (TWIS_SR offset) Status Register */
#define TWIS_SR_RESETVALUE          _U_(0x00000002); /**< \brief (TWIS_SR reset_value) Status Register */

#define TWIS_SR_RXRDY_Pos           0            /**< \brief (TWIS_SR) RX Buffer Ready */
#define TWIS_SR_RXRDY               (_U_(0x1) << TWIS_SR_RXRDY_Pos)
#define TWIS_SR_TXRDY_Pos           1            /**< \brief (TWIS_SR) TX Buffer Ready */
#define TWIS_SR_TXRDY               (_U_(0x1) << TWIS_SR_TXRDY_Pos)
#define TWIS_SR_SEN_Pos             2            /**< \brief (TWIS_SR) Slave Enabled */
#define TWIS_SR_SEN                 (_U_(0x1) << TWIS_SR_SEN_Pos)
#define TWIS_SR_TCOMP_Pos           3            /**< \brief (TWIS_SR) Transmission Complete */
#define TWIS_SR_TCOMP               (_U_(0x1) << TWIS_SR_TCOMP_Pos)
#define TWIS_SR_TRA_Pos             5            /**< \brief (TWIS_SR) Transmitter Mode */
#define TWIS_SR_TRA                 (_U_(0x1) << TWIS_SR_TRA_Pos)
#define TWIS_SR_URUN_Pos            6            /**< \brief (TWIS_SR) Underrun */
#define TWIS_SR_URUN                (_U_(0x1) << TWIS_SR_URUN_Pos)
#define TWIS_SR_ORUN_Pos            7            /**< \brief (TWIS_SR) Overrun */
#define TWIS_SR_ORUN                (_U_(0x1) << TWIS_SR_ORUN_Pos)
#define TWIS_SR_NAK_Pos             8            /**< \brief (TWIS_SR) NAK Received */
#define TWIS_SR_NAK                 (_U_(0x1) << TWIS_SR_NAK_Pos)
#define TWIS_SR_SMBTOUT_Pos         12           /**< \brief (TWIS_SR) SMBus Timeout */
#define TWIS_SR_SMBTOUT             (_U_(0x1) << TWIS_SR_SMBTOUT_Pos)
#define TWIS_SR_SMBPECERR_Pos       13           /**< \brief (TWIS_SR) SMBus PEC Error */
#define TWIS_SR_SMBPECERR           (_U_(0x1) << TWIS_SR_SMBPECERR_Pos)
#define TWIS_SR_BUSERR_Pos          14           /**< \brief (TWIS_SR) Bus Error */
#define TWIS_SR_BUSERR              (_U_(0x1) << TWIS_SR_BUSERR_Pos)
#define TWIS_SR_SAM_Pos             16           /**< \brief (TWIS_SR) Slave Address Match */
#define TWIS_SR_SAM                 (_U_(0x1) << TWIS_SR_SAM_Pos)
#define TWIS_SR_GCM_Pos             17           /**< \brief (TWIS_SR) General Call Match */
#define TWIS_SR_GCM                 (_U_(0x1) << TWIS_SR_GCM_Pos)
#define TWIS_SR_SMBALERTM_Pos       18           /**< \brief (TWIS_SR) SMBus Alert Response Address Match */
#define TWIS_SR_SMBALERTM           (_U_(0x1) << TWIS_SR_SMBALERTM_Pos)
#define TWIS_SR_SMBHHM_Pos          19           /**< \brief (TWIS_SR) SMBus Host Header Address Match */
#define TWIS_SR_SMBHHM              (_U_(0x1) << TWIS_SR_SMBHHM_Pos)
#define TWIS_SR_SMBDAM_Pos          20           /**< \brief (TWIS_SR) SMBus Default Address Match */
#define TWIS_SR_SMBDAM              (_U_(0x1) << TWIS_SR_SMBDAM_Pos)
#define TWIS_SR_STO_Pos             21           /**< \brief (TWIS_SR) Stop Received */
#define TWIS_SR_STO                 (_U_(0x1) << TWIS_SR_STO_Pos)
#define TWIS_SR_REP_Pos             22           /**< \brief (TWIS_SR) Repeated Start Received */
#define TWIS_SR_REP                 (_U_(0x1) << TWIS_SR_REP_Pos)
#define TWIS_SR_BTF_Pos             23           /**< \brief (TWIS_SR) Byte Transfer Finished */
#define TWIS_SR_BTF                 (_U_(0x1) << TWIS_SR_BTF_Pos)
#define TWIS_SR_MASK                _U_(0x00FF71EF) /**< \brief (TWIS_SR) MASK Register */

/* -------- TWIS_IER : (TWIS Offset: 0x1C) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXRDY:1;          /*!< bit:      0  RX Buffer Ready                    */
    uint32_t TXRDY:1;          /*!< bit:      1  TX Buffer Ready                    */
    uint32_t :1;               /*!< bit:      2  Reserved                           */
    uint32_t TCOMP:1;          /*!< bit:      3  Transmission Complete              */
    uint32_t :2;               /*!< bit:  4.. 5  Reserved                           */
    uint32_t URUN:1;           /*!< bit:      6  Underrun                           */
    uint32_t ORUN:1;           /*!< bit:      7  Overrun                            */
    uint32_t NAK:1;            /*!< bit:      8  NAK Received                       */
    uint32_t :3;               /*!< bit:  9..11  Reserved                           */
    uint32_t SMBTOUT:1;        /*!< bit:     12  SMBus Timeout                      */
    uint32_t SMBPECERR:1;      /*!< bit:     13  SMBus PEC Error                    */
    uint32_t BUSERR:1;         /*!< bit:     14  Bus Error                          */
    uint32_t :1;               /*!< bit:     15  Reserved                           */
    uint32_t SAM:1;            /*!< bit:     16  Slave Address Match                */
    uint32_t GCM:1;            /*!< bit:     17  General Call Match                 */
    uint32_t SMBALERTM:1;      /*!< bit:     18  SMBus Alert Response Address Match */
    uint32_t SMBHHM:1;         /*!< bit:     19  SMBus Host Header Address Match    */
    uint32_t SMBDAM:1;         /*!< bit:     20  SMBus Default Address Match        */
    uint32_t STO:1;            /*!< bit:     21  Stop Received                      */
    uint32_t REP:1;            /*!< bit:     22  Repeated Start Received            */
    uint32_t BTF:1;            /*!< bit:     23  Byte Transfer Finished             */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_IER_OFFSET             0x1C         /**< \brief (TWIS_IER offset) Interrupt Enable Register */
#define TWIS_IER_RESETVALUE         _U_(0x00000000); /**< \brief (TWIS_IER reset_value) Interrupt Enable Register */

#define TWIS_IER_RXRDY_Pos          0            /**< \brief (TWIS_IER) RX Buffer Ready */
#define TWIS_IER_RXRDY              (_U_(0x1) << TWIS_IER_RXRDY_Pos)
#define TWIS_IER_TXRDY_Pos          1            /**< \brief (TWIS_IER) TX Buffer Ready */
#define TWIS_IER_TXRDY              (_U_(0x1) << TWIS_IER_TXRDY_Pos)
#define TWIS_IER_TCOMP_Pos          3            /**< \brief (TWIS_IER) Transmission Complete */
#define TWIS_IER_TCOMP              (_U_(0x1) << TWIS_IER_TCOMP_Pos)
#define TWIS_IER_URUN_Pos           6            /**< \brief (TWIS_IER) Underrun */
#define TWIS_IER_URUN               (_U_(0x1) << TWIS_IER_URUN_Pos)
#define TWIS_IER_ORUN_Pos           7            /**< \brief (TWIS_IER) Overrun */
#define TWIS_IER_ORUN               (_U_(0x1) << TWIS_IER_ORUN_Pos)
#define TWIS_IER_NAK_Pos            8            /**< \brief (TWIS_IER) NAK Received */
#define TWIS_IER_NAK                (_U_(0x1) << TWIS_IER_NAK_Pos)
#define TWIS_IER_SMBTOUT_Pos        12           /**< \brief (TWIS_IER) SMBus Timeout */
#define TWIS_IER_SMBTOUT            (_U_(0x1) << TWIS_IER_SMBTOUT_Pos)
#define TWIS_IER_SMBPECERR_Pos      13           /**< \brief (TWIS_IER) SMBus PEC Error */
#define TWIS_IER_SMBPECERR          (_U_(0x1) << TWIS_IER_SMBPECERR_Pos)
#define TWIS_IER_BUSERR_Pos         14           /**< \brief (TWIS_IER) Bus Error */
#define TWIS_IER_BUSERR             (_U_(0x1) << TWIS_IER_BUSERR_Pos)
#define TWIS_IER_SAM_Pos            16           /**< \brief (TWIS_IER) Slave Address Match */
#define TWIS_IER_SAM                (_U_(0x1) << TWIS_IER_SAM_Pos)
#define TWIS_IER_GCM_Pos            17           /**< \brief (TWIS_IER) General Call Match */
#define TWIS_IER_GCM                (_U_(0x1) << TWIS_IER_GCM_Pos)
#define TWIS_IER_SMBALERTM_Pos      18           /**< \brief (TWIS_IER) SMBus Alert Response Address Match */
#define TWIS_IER_SMBALERTM          (_U_(0x1) << TWIS_IER_SMBALERTM_Pos)
#define TWIS_IER_SMBHHM_Pos         19           /**< \brief (TWIS_IER) SMBus Host Header Address Match */
#define TWIS_IER_SMBHHM             (_U_(0x1) << TWIS_IER_SMBHHM_Pos)
#define TWIS_IER_SMBDAM_Pos         20           /**< \brief (TWIS_IER) SMBus Default Address Match */
#define TWIS_IER_SMBDAM             (_U_(0x1) << TWIS_IER_SMBDAM_Pos)
#define TWIS_IER_STO_Pos            21           /**< \brief (TWIS_IER) Stop Received */
#define TWIS_IER_STO                (_U_(0x1) << TWIS_IER_STO_Pos)
#define TWIS_IER_REP_Pos            22           /**< \brief (TWIS_IER) Repeated Start Received */
#define TWIS_IER_REP                (_U_(0x1) << TWIS_IER_REP_Pos)
#define TWIS_IER_BTF_Pos            23           /**< \brief (TWIS_IER) Byte Transfer Finished */
#define TWIS_IER_BTF                (_U_(0x1) << TWIS_IER_BTF_Pos)
#define TWIS_IER_MASK               _U_(0x00FF71CB) /**< \brief (TWIS_IER) MASK Register */

/* -------- TWIS_IDR : (TWIS Offset: 0x20) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXRDY:1;          /*!< bit:      0  RX Buffer Ready                    */
    uint32_t TXRDY:1;          /*!< bit:      1  TX Buffer Ready                    */
    uint32_t :1;               /*!< bit:      2  Reserved                           */
    uint32_t TCOMP:1;          /*!< bit:      3  Transmission Complete              */
    uint32_t :2;               /*!< bit:  4.. 5  Reserved                           */
    uint32_t URUN:1;           /*!< bit:      6  Underrun                           */
    uint32_t ORUN:1;           /*!< bit:      7  Overrun                            */
    uint32_t NAK:1;            /*!< bit:      8  NAK Received                       */
    uint32_t :3;               /*!< bit:  9..11  Reserved                           */
    uint32_t SMBTOUT:1;        /*!< bit:     12  SMBus Timeout                      */
    uint32_t SMBPECERR:1;      /*!< bit:     13  SMBus PEC Error                    */
    uint32_t BUSERR:1;         /*!< bit:     14  Bus Error                          */
    uint32_t :1;               /*!< bit:     15  Reserved                           */
    uint32_t SAM:1;            /*!< bit:     16  Slave Address Match                */
    uint32_t GCM:1;            /*!< bit:     17  General Call Match                 */
    uint32_t SMBALERTM:1;      /*!< bit:     18  SMBus Alert Response Address Match */
    uint32_t SMBHHM:1;         /*!< bit:     19  SMBus Host Header Address Match    */
    uint32_t SMBDAM:1;         /*!< bit:     20  SMBus Default Address Match        */
    uint32_t STO:1;            /*!< bit:     21  Stop Received                      */
    uint32_t REP:1;            /*!< bit:     22  Repeated Start Received            */
    uint32_t BTF:1;            /*!< bit:     23  Byte Transfer Finished             */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_IDR_OFFSET             0x20         /**< \brief (TWIS_IDR offset) Interrupt Disable Register */
#define TWIS_IDR_RESETVALUE         _U_(0x00000000); /**< \brief (TWIS_IDR reset_value) Interrupt Disable Register */

