zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/twis.h
/* -------- TWIS_PR : (TWIS Offset: 0x2C) (R/  32) Parameter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t HS:1;             /*!< bit:      0  HS-mode                            */
    uint32_t :31;              /*!< bit:  1..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_PR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_PR_OFFSET              0x2C         /**< \brief (TWIS_PR offset) Parameter Register */
#define TWIS_PR_RESETVALUE          _U_(0x00000001); /**< \brief (TWIS_PR reset_value) Parameter Register */

#define TWIS_PR_HS_Pos              0            /**< \brief (TWIS_PR) HS-mode */
#define TWIS_PR_HS                  (_U_(0x1) << TWIS_PR_HS_Pos)
#define TWIS_PR_MASK                _U_(0x00000001) /**< \brief (TWIS_PR) MASK Register */

/* -------- TWIS_VR : (TWIS Offset: 0x30) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version Number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant Number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_VR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_VR_OFFSET              0x30         /**< \brief (TWIS_VR offset) Version Register */
#define TWIS_VR_RESETVALUE          _U_(0x00000140); /**< \brief (TWIS_VR reset_value) Version Register */

#define TWIS_VR_VERSION_Pos         0            /**< \brief (TWIS_VR) Version Number */
#define TWIS_VR_VERSION_Msk         (_U_(0xFFF) << TWIS_VR_VERSION_Pos)
#define TWIS_VR_VERSION(value)      (TWIS_VR_VERSION_Msk & ((value) << TWIS_VR_VERSION_Pos))
#define TWIS_VR_VARIANT_Pos         16           /**< \brief (TWIS_VR) Variant Number */
#define TWIS_VR_VARIANT_Msk         (_U_(0xF) << TWIS_VR_VARIANT_Pos)
#define TWIS_VR_VARIANT(value)      (TWIS_VR_VARIANT_Msk & ((value) << TWIS_VR_VARIANT_Pos))
#define TWIS_VR_MASK                _U_(0x000F0FFF) /**< \brief (TWIS_VR) MASK Register */

/* -------- TWIS_HSTR : (TWIS Offset: 0x34) (R/W 32) HS-mode Timing Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :16;              /*!< bit:  0..15  Reserved                           */
    uint32_t HDDAT:8;          /*!< bit: 16..23  Data Hold Cycles                   */
    uint32_t :8;               /*!< bit: 24..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_HSTR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_HSTR_OFFSET            0x34         /**< \brief (TWIS_HSTR offset) HS-mode Timing Register */
#define TWIS_HSTR_RESETVALUE        _U_(0x00000000); /**< \brief (TWIS_HSTR reset_value) HS-mode Timing Register */

#define TWIS_HSTR_HDDAT_Pos         16           /**< \brief (TWIS_HSTR) Data Hold Cycles */
#define TWIS_HSTR_HDDAT_Msk         (_U_(0xFF) << TWIS_HSTR_HDDAT_Pos)
#define TWIS_HSTR_HDDAT(value)      (TWIS_HSTR_HDDAT_Msk & ((value) << TWIS_HSTR_HDDAT_Pos))
#define TWIS_HSTR_MASK              _U_(0x00FF0000) /**< \brief (TWIS_HSTR) MASK Register */

/* -------- TWIS_SRR : (TWIS Offset: 0x38) (R/W 32) Slew Rate Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DADRIVEL:3;       /*!< bit:  0.. 2  Data Drive Strength LOW            */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t DASLEW:2;         /*!< bit:  8.. 9  Data Slew Limit                    */
    uint32_t :18;              /*!< bit: 10..27  Reserved                           */
    uint32_t FILTER:2;         /*!< bit: 28..29  Input Spike Filter Control         */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_SRR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_SRR_OFFSET             0x38         /**< \brief (TWIS_SRR offset) Slew Rate Register */
#define TWIS_SRR_RESETVALUE         _U_(0x00000000); /**< \brief (TWIS_SRR reset_value) Slew Rate Register */

#define TWIS_SRR_DADRIVEL_Pos       0            /**< \brief (TWIS_SRR) Data Drive Strength LOW */
#define TWIS_SRR_DADRIVEL_Msk       (_U_(0x7) << TWIS_SRR_DADRIVEL_Pos)
#define TWIS_SRR_DADRIVEL(value)    (TWIS_SRR_DADRIVEL_Msk & ((value) << TWIS_SRR_DADRIVEL_Pos))
#define TWIS_SRR_DASLEW_Pos         8            /**< \brief (TWIS_SRR) Data Slew Limit */
#define TWIS_SRR_DASLEW_Msk         (_U_(0x3) << TWIS_SRR_DASLEW_Pos)
#define TWIS_SRR_DASLEW(value)      (TWIS_SRR_DASLEW_Msk & ((value) << TWIS_SRR_DASLEW_Pos))
#define TWIS_SRR_FILTER_Pos         28           /**< \brief (TWIS_SRR) Input Spike Filter Control */
#define TWIS_SRR_FILTER_Msk         (_U_(0x3) << TWIS_SRR_FILTER_Pos)
#define TWIS_SRR_FILTER(value)      (TWIS_SRR_FILTER_Msk & ((value) << TWIS_SRR_FILTER_Pos))
#define TWIS_SRR_MASK               _U_(0x30000307) /**< \brief (TWIS_SRR) MASK Register */

/* -------- TWIS_HSSRR : (TWIS Offset: 0x3C) (R/W 32) HS-mode Slew Rate Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DADRIVEL:3;       /*!< bit:  0.. 2  Data Drive Strength LOW            */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t DASLEW:2;         /*!< bit:  8.. 9  Data Slew Limit                    */
    uint32_t :18;              /*!< bit: 10..27  Reserved                           */
    uint32_t FILTER:2;         /*!< bit: 28..29  Input Spike Filter Control         */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIS_HSSRR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIS_HSSRR_OFFSET           0x3C         /**< \brief (TWIS_HSSRR offset) HS-mode Slew Rate Register */
#define TWIS_HSSRR_RESETVALUE       _U_(0x00000000); /**< \brief (TWIS_HSSRR reset_value) HS-mode Slew Rate Register */

#define TWIS_HSSRR_DADRIVEL_Pos     0            /**< \brief (TWIS_HSSRR) Data Drive Strength LOW */
#define TWIS_HSSRR_DADRIVEL_Msk     (_U_(0x7) << TWIS_HSSRR_DADRIVEL_Pos)
#define TWIS_HSSRR_DADRIVEL(value)  (TWIS_HSSRR_DADRIVEL_Msk & ((value) << TWIS_HSSRR_DADRIVEL_Pos))
#define TWIS_HSSRR_DASLEW_Pos       8            /**< \brief (TWIS_HSSRR) Data Slew Limit */
#define TWIS_HSSRR_DASLEW_Msk       (_U_(0x3) << TWIS_HSSRR_DASLEW_Pos)
#define TWIS_HSSRR_DASLEW(value)    (TWIS_HSSRR_DASLEW_Msk & ((value) << TWIS_HSSRR_DASLEW_Pos))
#define TWIS_HSSRR_FILTER_Pos       28           /**< \brief (TWIS_HSSRR) Input Spike Filter Control */
#define TWIS_HSSRR_FILTER_Msk       (_U_(0x3) << TWIS_HSSRR_FILTER_Pos)
#define TWIS_HSSRR_FILTER(value)    (TWIS_HSSRR_FILTER_Msk & ((value) << TWIS_HSSRR_FILTER_Pos))
#define TWIS_HSSRR_MASK             _U_(0x30000307) /**< \brief (TWIS_HSSRR) MASK Register */

/** \brief TWIS hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO TWIS_CR_Type              CR;          /**< \brief Offset: 0x00 (R/W 32) Control Register */
  __IO TWIS_NBYTES_Type          NBYTES;      /**< \brief Offset: 0x04 (R/W 32) NBYTES Register */
  __IO TWIS_TR_Type              TR;          /**< \brief Offset: 0x08 (R/W 32) Timing Register */
  __I  TWIS_RHR_Type             RHR;         /**< \brief Offset: 0x0C (R/  32) Receive Holding Register */
  __O  TWIS_THR_Type             THR;         /**< \brief Offset: 0x10 ( /W 32) Transmit Holding Register */
  __I  TWIS_PECR_Type            PECR;        /**< \brief Offset: 0x14 (R/  32) Packet Error Check Register */
  __I  TWIS_SR_Type              SR;          /**< \brief Offset: 0x18 (R/  32) Status Register */
  __O  TWIS_IER_Type             IER;         /**< \brief Offset: 0x1C ( /W 32) Interrupt Enable Register */
  __O  TWIS_IDR_Type             IDR;         /**< \brief Offset: 0x20 ( /W 32) Interrupt Disable Register */
  __I  TWIS_IMR_Type             IMR;         /**< \brief Offset: 0x24 (R/  32) Interrupt Mask Register */
  __O  TWIS_SCR_Type             SCR;         /**< \brief Offset: 0x28 ( /W 32) Status Clear Register */
  __I  TWIS_PR_Type              PR;          /**< \brief Offset: 0x2C (R/  32) Parameter Register */
  __I  TWIS_VR_Type              VR;          /**< \brief Offset: 0x30 (R/  32) Version Register */
  __IO TWIS_HSTR_Type            HSTR;        /**< \brief Offset: 0x34 (R/W 32) HS-mode Timing Register */
  __IO TWIS_SRR_Type             SRR;         /**< \brief Offset: 0x38 (R/W 32) Slew Rate Register */
  __IO TWIS_HSSRR_Type           HSSRR;       /**< \brief Offset: 0x3C (R/W 32) HS-mode Slew Rate Register */
 } bf;
 struct {
  RwReg   TWIS_CR;            /**< \brief (TWIS Offset: 0x00) Control Register */
  RwReg   TWIS_NBYTES;        /**< \brief (TWIS Offset: 0x04) NBYTES Register */
  RwReg   TWIS_TR;            /**< \brief (TWIS Offset: 0x08) Timing Register */
  RoReg   TWIS_RHR;           /**< \brief (TWIS Offset: 0x0C) Receive Holding Register */
  WoReg   TWIS_THR;           /**< \brief (TWIS Offset: 0x10) Transmit Holding Register */
  RoReg   TWIS_PECR;          /**< \brief (TWIS Offset: 0x14) Packet Error Check Register */
  RoReg   TWIS_SR;            /**< \brief (TWIS Offset: 0x18) Status Register */
  WoReg   TWIS_IER;           /**< \brief (TWIS Offset: 0x1C) Interrupt Enable Register */
  WoReg   TWIS_IDR;           /**< \brief (TWIS Offset: 0x20) Interrupt Disable Register */
  RoReg   TWIS_IMR;           /**< \brief (TWIS Offset: 0x24) Interrupt Mask Register */
  WoReg   TWIS_SCR;           /**< \brief (TWIS Offset: 0x28) Status Clear Register */
  RoReg   TWIS_PR;            /**< \brief (TWIS Offset: 0x2C) Parameter Register */
  RoReg   TWIS_VR;            /**< \brief (TWIS Offset: 0x30) Version Register */
  RwReg   TWIS_HSTR;          /**< \brief (TWIS Offset: 0x34) HS-mode Timing Register */
  RwReg   TWIS_SRR;           /**< \brief (TWIS Offset: 0x38) Slew Rate Register */
  RwReg   TWIS_HSSRR;         /**< \brief (TWIS Offset: 0x3C) HS-mode Slew Rate Register */
 } reg;
} Twis;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_TWIS_COMPONENT_ */
